In [34]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt
import matplotlib.ticker as ticker

In [35]:
# read the dataset
df = pd.read_csv('../../data/raw_data/Titanic/train.csv')
df_test = pd.read_csv('../../data/raw_data/Titanic/test.csv')

In [36]:
# show the first 5 rows
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [37]:
# show the first 5 rows
df_test.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [38]:
# dataset dimension
df.shape

(891, 12)

In [39]:
# dataset dimension
df_test.shape

(418, 11)

In [40]:
# show the column types
df.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [41]:
# number of unique values per feature
df.nunique().sort_values(ascending=False)

Name           891
PassengerId    891
Ticket         681
Fare           248
Cabin          147
Age             88
Parch            7
SibSp            7
Embarked         3
Pclass           3
Sex              2
Survived         2
dtype: int64

In [42]:
# drop column 'Name' and 'PassengerId'as irrelevant
df = df.drop(columns = ['Name', 'PassengerId', 'Ticket'])
df_test = df_test.drop(columns = ['Name', 'PassengerId', 'Ticket'])

In [43]:
# check if there are NaN values
print("Train: ", df.isna().values.any())
print("Test: ", df_test.isna().values.any())

Train:  True
Test:  True

In [44]:
# number of missing values per feature
df.isnull().sum().sort_values(ascending=False)

Cabin       687
Age         177
Embarked      2
Fare          0
Parch         0
SibSp         0
Sex           0
Pclass        0
Survived      0
dtype: int64

In [45]:
# number of missing values per feature
df_test.isnull().sum().sort_values(ascending=False)

Cabin       327
Age          86
Fare          1
Embarked      0
Parch         0
SibSp         0
Sex           0
Pclass        0
dtype: int64

In [46]:
# drop the column with highest number of missing values
df = df.drop(columns=['Cabin'])
df_test = df_test.drop(columns=['Cabin'])

In [10]:
df_age_mean = float('{:.2f}'.format(df['Age'].mean()))

df['Age'] = df['Age'].fillna(value = df_age_mean)
df_test['Age'] = df_test['Age'].fillna(value = df_age_mean)

In [11]:
df_train = df_train.dropna()
df_train = df_train.iloc[:-1]

In [12]:
df_train.shape

(888, 10)

In [13]:
df_test = df_test.dropna()
df_test = df_test.iloc[:-5]

In [14]:
df_test.shape

(412, 9)

In [15]:
X_train = df_train[['Ticket_class', 'Sex', 'Age', 'Sibling_Spouse_relations', 'Parent_Child_relations', 'Fare', 'Embarked']]
y_train = df_train['Survived']